/*************************************************************
                     Ê±ÖÓÏÔÊ¾³ÌÐò
³ÌÐò±àÐ´£ºFucp   2015-5-16
DIYÌ×¼þ  http://59tiaoba.taobao.com

µ¥Æ¬»ú IAP15W4K61S4  »òÕßÆäËû51	 ¾§ÕñÆµÂÊ 18.432M  
×ÖÄ£Èí¼þÓÃ  PC2002
ÖðÁÐÈ¡Ä£·½Ê½

µç»úÐý×ª·½Ïò Ë³Ê±Õë
/***********************************************************
ËµÃ÷£º±¾³ÌÐòÖ§³ÖÅäÌ×Ò£¿ØÆ÷µ÷ÕûÊ±¼ä
²¥·Å°´¼ü  ÇÐ»»µ÷Õû Ê±¡¢·Ö¡¢Ãë¡¢ÔÂ¡¢ÈÕ
¼Ó °´¼ü£ºÔö¼Ó
¼õ °´¼ü£º¼õÉÙ
menu°´¼ü£º Ê±ÖÓ¸´Î»

Æ½ÃæÏÔÊ¾ÎÄ×Ö+²àÃæÏÔÊ¾Ê±ÖÓ

*************************************************************/
#include "NEW_8051.H"
#include "intrins.h"
#include "task.h"
bit Scan_bit=0;
bit BIT_timeout=0;



/*********ÖÐ¶Ï×Ó³ÌÐò**********/
void int0() interrupt 0	//Ê¹ÓÃÍâ²¿ÖÐ¶Ï0
{
	BIT_timeout=1; //Æðµã±êÖ¾Î»	
}
/******************************************/
void Send_uart(unsigned char d)	  /*´Ó´®¿Ú·¢ËÍÊý¾Ý*/
{
	  ES=0;
      SBUF=d;
	  while(TI==0);       //µÈ´ý·¢ËÍÍê±Ï
      TI=0;
	  ES=1;
}
/*********************************************/
void Init(void)
{
   	P0M0=0X00;//³õÊ¼»¯IO¿Ú Îª×¼Ë«Ïò¿Ú
	P0M1=0X00;

	P1M0=0X00;
	P1M1=0X00;

	P2M0=0X00;
	P2M1=0X00;

	P3M0=0X00;
	P3M1=0X00;

	P4M0=0X00;
	P4M1=0X00;

	P5M0=0X00;
	P5M1=0X00;

	P6M0=0X00;
	P6M1=0X00;

	P7M0=0X00;
	P7M1=0X00;

	Show_R(0x55,0x55);//²âÊÔ
	Show_L(0x55,0x55,0x55,0x55);//²âÊÔ
	AUXR &= 0x7F;		//¶¨Ê±Æ÷Ê±ÖÓ12TÄ£Ê½
	TMOD &= 0xF0;		//ÉèÖÃ¶¨Ê±Æ÷Ä£Ê½
	TL0 = 0x12;		//ÉèÖÃ¶¨Ê±³õÖµ
	TH0 = 0xFF;		//ÉèÖÃ¶¨Ê±³õÖµ
	TF0 = 0;		//Çå³ýTF0±êÖ¾
	ET0=1;
	//TR0 = 1;		//¶¨Ê±Æ÷0¿ªÊ¼¼ÆÊ±

	SCON = 0x50;		//8Î»Êý¾Ý,¿É±ä²¨ÌØÂÊ
	AUXR &= 0xBF;		//¶¨Ê±Æ÷1Ê±ÖÓÎªFosc/12,¼´12T
	AUXR &= 0xFE;		//´®¿Ú1Ñ¡Ôñ¶¨Ê±Æ÷1Îª²¨ÌØÂÊ·¢ÉúÆ÷
	TMOD &= 0x0F;		//Éè¶¨¶¨Ê±Æ÷1Îª16Î»×Ô¶¯ÖØ×°·½Ê½
	TL1 = 0xD8;		//Éè¶¨¶¨Ê±³õÖµ
	TH1 = 0xFF;		//Éè¶¨¶¨Ê±³õÖµ
	ET1 = 0;		//½ûÖ¹¶¨Ê±Æ÷1ÖÐ¶Ï
	TR1 = 1;		//Æô¶¯¶¨Ê±Æ÷1

     IT0 = 1;    //Íâ²¿ÖÐ¶ÏÎª±ßÑØ´¥·¢
                   //ÉèÖÃINT0µÄÖÐ¶ÏÀàÐÍ (1:½öÏÂ½µÑØ 0:ÉÏÉýÑØºÍÏÂ½µÑØ)
     EX0 = 1;  //Ê¹ÄÜINT0ÖÐ¶Ï

	 IT1=1;
	 EX1=1;//Íâ²¿ÖÐ¶Ï1 ÏÂ½µÑØ ÖÐ¶Ï
	 EA = 1;                 
}
/*****Ö÷º¯Êý*****/
void main(void)
{
	Init();
	Auto_Set1302(starts_time);//×Ô¶¯³õÊ¼»¯Ê±ÖÓ
	Send_uart(0x55);
	
    //Ö÷³ÌÐò
   	while(1)
    {      	
         //BIT_timeout=1;
		if(BIT_timeout==1)	//ÆðµãÅÐ¶Ï
	 	{			
			BIT_timeout=0; //ÇåÁã
			
			Scan_bit=1;// Æðµã¼ì²âµ½ºó LED²»ÔÙÁ÷Ë®²âÊÔ
			if( new_code ) //ÓÐºìÍâ°´¼ü
			{
				new_code=0;
				switch( key_code ) //¸ù¾Ý²»Í¬µÄ°´¼üÖµÖ´ÐÐ²»Í¬µÄ¶¯×÷
				{	
				
					case 0x40:	 //µ÷Ê±¼Ó
						Set(id,1);

					break;
	
					case 0x19: //µ÷Ê±¼õ				
							Set(id,0); 
					
					break;
					
					case 0x15://µ÷Ê±ÇÐ»»
								id++;						
		   						if(id>5)
								{
		    						id=0;
								}
					break;
					case 0x47://Ê±ÖÓ³õÊ¼»¯
							Set1302(starts_time);    //³õÊ¼»¯ 
							W1302(0x8e,0x00); //¿ØÖÆÃüÁî,WP=0,Ð´²Ù×÷                
							W1302(0x90,0xa5); //´òª³äµ¶þ¼¶Ü  Ò»¸ö¶þ¼¶¹Ü´®ÁªÒ»¸ö2Kçè
							//write_1302Data(DISP_TIME_adder,160);
					break;
	
					default: break;
				}
				key_code=0;
			}
			du1302();//¶ÁÈ¡Ê±ÖÓÐ¾Æ¬ µÄÊ±ÖÓÊý¾Ý
			Show_line_time();//ÏÔÊ¾Ê±¼ä
    
            
    		}   
    
		}
}
/*********************************************************************************/
/*************************************************************************************
************************************************************************************
***********************                                     ***************************
***********************    http://59tiaoba.taobao.com       ***************************
***********************                                     ***************************
************************************************************************************
**********************************************************************************/