#ifndef __GPS_H_
#define __GPS_H_

/****************************
接收数据是否完整 
1有效
0无效
*****************************/
unsigned char Data_legitimate=0;

/****************************
GPS是否定位 
1有效
0无效
*****************************/
unsigned char GPS_lock;

/****************************
GPS使用卫星个数
*****************************/
unsigned char GPSUSE_satellite[2];

/****************************
GPS可见卫星个数
*****************************/
unsigned char GPSVISIBLE_satellite[2];

/****************************
GPS数据类型
1GPGGA
2GPGSV
3GPRMC
*****************************/
unsigned char GPSDATA_number;

/****************************
GPS数据模式
0结束模式
1类型模式
2数据模式
*****************************/
unsigned char GPSDATA_mode;

/****************************
逗号计数器
*****************************/
unsigned char GPSDOT_count;

/****************************
位数计数器
*****************************/
unsigned char GPSDATA_count;	

/****************************
类型模式存储数组
*****************************/
unsigned char GPSDATA_cmd[5];		

/****************************
纬度
*****************************/
unsigned char GPS_latitude[9];		

/****************************
纬度方向
*****************************/
unsigned char GPS_latitude_dir;

/****************************
经度
*****************************/
unsigned char GPS_longitude[10];

/****************************
经度方向
*****************************/
unsigned char GPS_longitude_dir;

/****************************
GPS速度
*****************************/
unsigned char GPS_speed[5]={'0','0','0','.','0'};	

/****************************
海拔高度
*****************************/
unsigned char GPS_altitude[6];	

/****************************
日期
*****************************/
unsigned char GPS_date[6];		

/****************************
时间
*****************************/
unsigned char GPS_time[6];		

/****************************
方位角
*****************************/
unsigned char GPS_Angle[5]={'0','0','0','0','0'};		

/****************************
方位角
*****************************/
unsigned char OUT_speed[5];


#endif
